In [2]:
import pandas as pd

In [3]:
# DataFrame
# It is 2D data representation as same as Oracle Table
# DataFrame data is In memory process

In [4]:
# DataFrame - Basic Command
# Filteration
# Data Cleaning / Munging
# Group, Aggregation, Transformation
# File Operations
# Plotting
# Time series

In [5]:
# File operations (Reading and Writing)
# File Reading from the .csv

In [6]:
# Creations of DataFrame
# pd.DataFrame(data,column,index)
# pd.DataFrame(data) # data is mandatory
# DataFrame -> List,tuple,dictinary,Series,Numpy Arrays

In [7]:
df=pd.DataFrame([10,20,30,40])

In [8]:
print(df)

    0
0  10
1  20
2  30
3  40

In [9]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [11]:
df1=pd.DataFrame((10,20,30,40))

In [12]:
print(df1)

    0
0  10
1  20
2  30
3  40

In [13]:
di={'City':['Kolkatta','Mumbai','Delhi','Bengaluru','Chennai']}

In [14]:
di

{'City': ['Kolkatta', 'Mumbai', 'Delhi', 'Bengaluru', 'Chennai']}

In [15]:
city=pd.DataFrame(di)

In [16]:
city

        City
0   Kolkatta
1     Mumbai
2      Delhi
3  Bengaluru
4    Chennai

In [17]:
comp={'Name':['Google','Microsoft','Oracle','IBM'],
     'Sal':[5000,4500,6000,3000],
     'Benefit':[5,10,11,2]}

In [18]:
comp

{'Name': ['Google', 'Microsoft', 'Oracle', 'IBM'],
 'Sal': [5000, 4500, 6000, 3000],
 'Benefit': [5, 10, 11, 2]}

In [20]:
comp_df=pd.DataFrame(comp)

In [21]:
comp_df

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [22]:
print(type(comp_df))

<class 'pandas.core.frame.DataFrame'>

In [23]:
# shape -> it will depict the rows and column (Rows,Columns)
comp_df.shape

(4, 3)

In [24]:
# index -> it will depict the index of the DataFrame
comp_df.index

RangeIndex(start=0, stop=4, step=1)

In [25]:
# columns -> it will depict the columns name into the DataFrame
comp_df.columns

Index(['Name', 'Sal', 'Benefit'], dtype='object')

In [26]:
# len -> it will count the total rows into the DataFrame
len(comp_df)

4

In [27]:
# info() -> it will describe about DataFrame column wise
comp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Name       4 non-null object
Sal        4 non-null int64
Benefit    4 non-null int64
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [28]:
comp_df.info

<bound method DataFrame.info of         Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2>

In [29]:
# Slicing
comp_df

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [30]:
comp_df['Name']

0       Google
1    Microsoft
2       Oracle
3          IBM
Name: Name, dtype: object

In [31]:
comp_df['Sal']

0    5000
1    4500
2    6000
3    3000
Name: Sal, dtype: int64

In [32]:
comp_df['Benefit']

0     5
1    10
2    11
3     2
Name: Benefit, dtype: int64

In [33]:
# Name and Benefit
comp_df[['Name','Benefit']]

        Name  Benefit
0     Google        5
1  Microsoft       10
2     Oracle       11
3        IBM        2

In [38]:
comp_df

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [40]:
comp_df[::]

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [50]:
# Row selections
comp_df[:][:] # [:] - all columns and [:] all rows

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [51]:
# Row selections
comp_df[:][0:3]

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11

In [56]:
comp_df[['Name','Benefit']][1:3]

        Name  Benefit
1  Microsoft       10
2     Oracle       11

In [57]:
# EDA -> Exploratory Data Analysis
# head() -> First 5 rows of data will be shown 
# head(n) -> it will returns n number or rows from the start
# tail() -> Default last 5 rows will shown
# tail(n) -> it will returns n number of rows from the end

In [59]:
# read csv file
# read_csv()

NameError: name 'pwd' is not defined

In [60]:
pwd

'C:\\Users\\HP P DTS'

In [61]:
cd e:

E:\

In [65]:
employee=pd.read_csv('E:\emp.csv')
columns=['empno','ename','jobs','mgr','hiredate','sal','comm','dob']

In [68]:
employee.columns=columns

In [70]:
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62 entries, 0 to 61
Data columns (total 8 columns):
empno       62 non-null int64
ename       59 non-null object
jobs        62 non-null object
mgr         59 non-null float64
hiredate    44 non-null object
sal         50 non-null float64
comm        12 non-null float64
dob         50 non-null float64
dtypes: float64(4), int64(1), object(3)
memory usage: 4.0+ KB

In [71]:
employee.shape

(62, 8)

In [72]:
employee.head()

   empno     ename       jobs     mgr hiredate     sal  comm   dob
0   1101    LIPIKA    STUDENT  1100.0      NaN     NaN   NaN   NaN
1   1102    SAKSHI    STUDENT  1100.0      NaN     NaN   NaN   NaN
2   1103  KHUSHBOO    STUDENT  1100.0      NaN     NaN   NaN   NaN
3   1104         R  DEVELOPER  7844.0      NaN  5500.0   NaN  10.0
4   1105       NaN   ENGINEER  7654.0      NaN     NaN   NaN   NaN

In [73]:
employee.tail()

    empno   ename      jobs     mgr             hiredate     sal  comm   dob
57   7844  TURNER  SALESMAN  7698.0  1981-09-08 00:00:00  1500.0   0.0  30.0
58   7876   ADAMS     CLERK  7788.0  1987-05-23 00:00:00  1100.0   NaN  20.0
59   7900   JAMES     CLERK  7698.0  1981-12-03 00:00:00   950.0   NaN  30.0
60   7902    FORD   ANALYST  7566.0  1981-12-03 00:00:00  3000.0   NaN  20.0
61   7934  MILLER     CLERK  7782.0  1982-01-23 00:00:00  1300.0   NaN  10.0

In [74]:
employee.head(10)

,empno,ename,jobs,mgr,hiredate,sal,comm,dob
0,1101,LIPIKA,STUDENT,1100.0,NaN,NaN,NaN,NaN
1,1102,SAKSHI,STUDENT,1100.0,NaN,NaN,NaN,NaN
2,1103,KHUSHBOO,STUDENT,1100.0,NaN,NaN,NaN,NaN
3,1104,R,DEVELOPER,7844.0,NaN,5500.0,NaN,10.0
4,1105,NaN,ENGINEER,7654.0,NaN,NaN,NaN,NaN
5,1000,RAZA,ANALYST,1100.0,NaN,3000.0,NaN,20.0
6,7369,SMITH,CLERK,7902.0,1980-12-17 00:00:00,800.0,NaN,20.0
7,7499,ALLEN,SALESMAN,7698.0,1981-02-20 00:00:00,1600.0,300.0,30.0
8,7521,WARD,SALESMAN,7698.0,1981-02-22 00:00:00,1250.0,500.0,30.0
9,7566,JONES,MANAGER,7839.0,1981-04-02 00:00:00,2975.0,NaN,20.0

In [75]:
employee.tail(10)

,empno,ename,jobs,mgr,hiredate,sal,comm,dob
52,7654,MARTIN,SALESMAN,7698.0,1981-09-28 00:00:00,1250.0,1400.0,30.0
53,7698,BLAKE,MANAGER,7839.0,1981-05-01 00:00:00,2850.0,NaN,30.0
54,7782,CLARK,MANAGER,7839.0,1981-06-09 00:00:00,2450.0,NaN,10.0
55,7788,SCOTT,ANALYST,7566.0,1987-04-19 00:00:00,3000.0,NaN,20.0
56,7839,KING,PRESIDENT,NaN,1981-11-17 00:00:00,5000.0,NaN,10.0
57,7844,TURNER,SALESMAN,7698.0,1981-09-08 00:00:00,1500.0,0.0,30.0
58,7876,ADAMS,CLERK,7788.0,1987-05-23 00:00:00,1100.0,NaN,20.0
59,7900,JAMES,CLERK,7698.0,1981-12-03 00:00:00,950.0,NaN,30.0
60,7902,FORD,ANALYST,7566.0,1981-12-03 00:00:00,3000.0,NaN,20.0
61,7934,MILLER,CLERK,7782.0,1982-01-23 00:00:00,1300.0,NaN,10.0

In [76]:
# statistical functions
employee.describe()

             empno          mgr          sal         comm        dob
count    62.000000    59.000000    50.000000    12.000000  50.000000
mean   5584.854839  6393.305085  2491.500000   550.000000  21.200000
std    3132.294931  2699.090059  1528.175933   545.227225   7.730142
min    1000.000000  1100.000000   800.000000     0.000000  10.000000
25%    1104.000000  7566.000000  1250.000000   225.000000  20.000000
50%    7566.000000  7698.000000  2450.000000   400.000000  20.000000
75%    7839.000000  7839.000000  3000.000000   725.000000  30.000000
max    7934.000000  7902.000000  6000.000000  1400.000000  30.000000